Revit 2027 API
ParameterTypeId.TemplateName Property
 "Template"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TemplateName { get; }
Public Shared ReadOnly Property TemplateName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TemplateName {
	ForgeTypeId^ get ();
}
static member TemplateName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace